# YOLOv13n-Face-v4 - Version Optimisée basée sur l'État de l'Art 2025

# Model configuration
nc: 1  # number of classes (face)
scales:
  n: [0.50, 0.50, 1024]  # model depth, width, max_channels

# YOLOv13 backbone with enhanced modules
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2fTransformer, [128, True]]  # 2 - Enhanced with transformer
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2fTransformer, [256, True]]  # 4
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2fTransformer, [512, True]]  # 6
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2fTransformer, [1024, True]]  # 8
  - [-1, 1, EfficientFaceTransformer, [1024, 8, 4]]  # 9 - Global face features
  - [-1, 1, SPPF, [1024, 5]]  # 10

# YOLOv13 head with attention mechanisms
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 11
  - [[-1, 6], 1, Concat, [1]]  # 12 cat backbone P4
  - [-1, 3, C2fTransformer, [512, False]]  # 13
  - [-1, 1, TripletFaceAttention, [512, 8, 7]]  # 14 - Face-specific attention [dim, num_heads, window_size]
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 15
  - [[-1, 4], 1, Concat, [1]]  # 16 cat backbone P3
  - [-1, 3, C2fTransformer, [256, False]]  # 17 (P3/8-small)
  - [-1, 1, GeometricConsistency, [256, 5]]  # 18 - Pose robustness [in_channels, num_landmarks]
  
  - [-1, 1, Conv, [256, 3, 2]]  # 19
  - [[-1, 14], 1, Concat, [1]]  # 20 cat head P4
  - [-1, 3, C2fTransformer, [512, False]]  # 21 (P4/16-medium)
  - [-1, 1, NeuralArchitectureSearchBlock, [512, 512]]  # 22 - Adaptive architecture [in_channels, out_channels]
  
  - [-1, 1, Conv, [512, 3, 2]]  # 23
  - [[-1, 10], 1, Concat, [1]]  # 24 cat head P5
  - [-1, 3, C2fTransformer, [1024, False]]  # 25 (P5/32-large)
  - [-1, 1, MixtureOfExpertsBlock, [1024, 1024, 3]]  # 26 - Multi-expert fusion [in_channels, out_channels, num_experts]
  
  # Detection heads with face-specific design
  - [[18, 22, 26], 1, FaceDetect, [nc, 5, [], [256, 512, 1024]]]  # 27 - Enhanced face detection head [nc, num_landmarks, anchors, ch]

# Training hyperparameters optimized for face detection
hyp:
  lr0: 0.01  # initial learning rate
  lrf: 0.01  # final OneCycleLR learning rate
  momentum: 0.937  # SGD momentum/Adam beta1
  weight_decay: 0.0005  # optimizer weight decay
  warmup_epochs: 3.0  # warmup epochs
  warmup_momentum: 0.8  # warmup initial momentum
  warmup_bias_lr: 0.1  # warmup initial bias lr
  box: 7.5  # box loss gain
  cls: 0.5  # cls loss gain (scale with pixels)
  dfl: 1.5  # dfl loss gain
  pose: 12.0  # pose loss gain (for landmarks if used)
  kobj: 1.0  # keypoint obj loss gain
  label_smoothing: 0.0  # label smoothing
  nbs: 64  # nominal batch size
  hsv_h: 0.015  # image HSV-Hue augmentation
  hsv_s: 0.7  # image HSV-Saturation augmentation
  hsv_v: 0.4  # image HSV-Value augmentation
  degrees: 10.0  # image rotation for face variations
  translate: 0.1  # image translation
  scale: 0.5  # image scale for multi-scale faces
  shear: 0.0  # image shear
  perspective: 0.0  # image perspective
  flipud: 0.0  # image flip up-down (not for faces)
  fliplr: 0.5  # image flip left-right (important for faces)
  mosaic: 1.0  # image mosaic
  mixup: 0.2  # image mixup
  copy_paste: 0.1  # segment copy-paste for occlusion

# Face-specific augmentations
face_augment:
  occlusion_prob: 0.3  # probability of adding occlusions
  lighting_variation: 0.4  # lighting changes
  blur_prob: 0.2  # motion blur probability
  pose_variation: True  # 3D pose augmentation

# Model EMA configuration
ema:
  enabled: True
  decay: 0.9999
  tau: 2000
  updates: 0
  device: ''

# Optimization flags
optimize:
  fp16: True  # mixed precision training
  gradient_checkpointing: True  # save memory
  fuse: True  # fuse conv and bn
  profile: False  # profile model speed

# Face detection specific settings
face_settings:
  min_face_size: 20  # minimum face size in pixels
  nms_threshold: 0.45  # NMS threshold for faces
  confidence_threshold: 0.25  # confidence threshold
  max_faces: 1000  # maximum faces per image
  
# Advanced features
advanced:
  use_ema: True  # exponential moving average
  sync_bn: True  # synchronized batch norm
  label_smoothing: 0.1  # label smoothing epsilon
  focal_loss: False  # use focal loss
  auto_balance: False  # auto balance class weights