# YOLOv13n-Face Final - Configuration de Production
# Utilise UNIQUEMENT les modules existants du fork Ultralytics 8.3.148

# Model configuration
nc: 1  # number of classes (face)
scales:
  n: [0.33, 0.25, 1024]  # model depth, width, max_channels

# YOLOv13 backbone - Architecture progressive et efficace
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]  # 4
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2fPSA, [512]]  # 6 - C2f avec Position Sensitive Attention
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2fPSA, [1024]]  # 8 - Position Sensitive Attention
  - [-1, 1, SPPF, [1024, 5]]  # 9 - Spatial Pyramid Pooling Fast

# YOLOv13 head - Fusion multi-échelle optimisée
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 10
  - [[-1, 6], 1, Concat, [1]]  # 11 cat backbone P4
  - [-1, 3, C2f, [512, False]]  # 12
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 13
  - [[-1, 4], 1, Concat, [1]]  # 14 cat backbone P3
  - [-1, 3, C2f, [256, False]]  # 15 (P3/8-small)
  
  - [-1, 1, Conv, [256, 3, 2]]  # 16
  - [[-1, 12], 1, Concat, [1]]  # 17 cat head P4
  - [-1, 3, C2f, [512, False]]  # 18 (P4/16-medium)
  
  - [-1, 1, Conv, [512, 3, 2]]  # 19
  - [[-1, 9], 1, Concat, [1]]  # 20 cat head P5
  - [-1, 3, C2f, [1024, False]]  # 21 (P5/32-large)
  
  # Detection head
  - [[15, 18, 21], 1, Detect, [nc]]  # 22 Detect(P3, P4, P5)