# YOLOv13n-Face V3 - Architecture avancée avec dimensions corrigées
# Modules YOLOv13 personnalisés avec gestion appropriée des dimensions

# Parameters
nc: 1  # number of classes (face only)
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.50, 1024]  # width augmenté pour garantir dim >= num_heads
  s: [0.33, 0.75, 1024]  
  m: [0.67, 1.00, 768]   
  l: [1.00, 1.25, 512]   
  x: [1.33, 1.50, 512]   

# Backbone avec modules YOLOv13
backbone:
  # [from, repeats, module, args]
  # Stem
  - [-1, 1, Conv, [64, 6, 2, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]   # 1-P2/4
  
  # Stage 1 - P3/8 avec NAS
  - [-1, 1, Conv, [256, 3, 2]]   # 2
  - [-1, 3, NASBlock, [256, 256]]  # 3 - Architecture search blocks
  
  # Stage 2 - P4/16 avec Attention
  - [-1, 1, Conv, [512, 3, 2]]   # 4
  - [-1, 1, C2f, [512, True]]     # 5 - Feature extraction
  - [-1, 1, TripletFaceAttention, [512, 8, 7]]  # 6 - Attention (512/8=64 > 0)
  
  # Stage 3 - P5/32 avec Transformer
  - [-1, 1, Conv, [1024, 3, 2]]  # 7
  - [-1, 1, C2f, [1024, True]]    # 8
  - [-1, 1, EfficientViT, [1024, 16, 7]]  # 9 - Transformer (1024/16=64)
  - [-1, 1, SPPF, [1024, 5]]      # 10

# Head avec fusion cross-scale
head:
  # FPN avec Cross-Scale Fusion
  - [-1, 1, Conv, [512, 1, 1]]  # 11
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 12
  - [[-1, 6], 1, Concat, [1]]    # 13 - cat backbone P4
  - [-1, 1, CrossScaleFeatureFusion, [512, 512, 1]]  # 14 - Fusion légère (n=1)
  
  - [-1, 1, Conv, [256, 1, 1]]   # 15
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 16
  - [[-1, 3], 1, Concat, [1]]    # 17 - cat backbone P3
  - [-1, 1, CrossScaleFeatureFusion, [256, 256, 1]]  # 18 (P3/8-small)
  
  - [-1, 1, Conv, [256, 3, 2]]   # 19
  - [[-1, 15], 1, Concat, [1]]   # 20 - cat head P4
  - [-1, 1, CrossScaleFeatureFusion, [512, 512, 1]]  # 21 (P4/16-medium)
  
  - [-1, 1, Conv, [512, 3, 2]]   # 22
  - [[-1, 11], 1, Concat, [1]]   # 23 - cat head P5
  - [-1, 1, AdaptiveMoE, [1024, 1024, 3]]  # 24 - MoE au niveau P5
  
  # Detection head avec géométrie faciale
  - [[18, 21, 24], 1, GeometricFaceHead, [nc]]  # Face detection avec landmarks
