# YOLOv13n-Face V2 - Architecture optimisée
# Face Detection spécialisée avec modules avancés

# Parameters
nc: 1  # number of classes (face only)
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.50, 1024]  # Augmenté width de 0.25 à 0.50 pour éviter dim < num_heads
  s: [0.33, 0.75, 1024]  
  m: [0.67, 1.00, 768]   
  l: [1.00, 1.25, 512]   
  x: [1.33, 1.50, 512]   

# Backbone simplifié avec attention stratégique
backbone:
  # [from, repeats, module, args]
  # Stem classique YOLO
  - [-1, 1, Conv, [64, 6, 2, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]   # 1-P2/4
  - [-1, 1, C2f, [128, True]]     # 2 - Feature extraction classique
  
  # Stage 1 - P3/8 avec attention légère
  - [-1, 1, Conv, [256, 3, 2]]   # 3
  - [-1, 1, TripletFaceAttention, [256, 8, 7]]  # 4 - Attention avec plus de heads
  - [-1, 3, C2f, [256, True]]     # 5
  
  # Stage 2 - P4/16 
  - [-1, 1, Conv, [512, 3, 2]]   # 6
  - [-1, 3, C2f, [512, True]]     # 7
  - [-1, 1, EfficientViT, [512, 8, 7]]  # 8 - Un seul transformer
  
  # Stage 3 - P5/32
  - [-1, 1, Conv, [1024, 3, 2]]  # 9
  - [-1, 3, C2f, [1024, True]]    # 10
  - [-1, 1, SPPF, [1024, 5]]      # 11

# Head avec FPN classique
head:
  # FPN upsampling
  - [-1, 1, Conv, [512, 1, 1]]  # 12
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 13
  - [[-1, 8], 1, Concat, [1]]    # 14 - cat backbone P4
  - [-1, 3, C2f, [512, False]]   # 15
  
  - [-1, 1, Conv, [256, 1, 1]]   # 16
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 17
  - [[-1, 5], 1, Concat, [1]]    # 18 - cat backbone P3
  - [-1, 3, C2f, [256, False]]   # 19 (P3/8-small)
  
  # FPN downsampling
  - [-1, 1, Conv, [256, 3, 2]]   # 20
  - [[-1, 16], 1, Concat, [1]]   # 21 - cat head P4
  - [-1, 3, C2f, [512, False]]   # 22 (P4/16-medium)
  
  - [-1, 1, Conv, [512, 3, 2]]   # 23
  - [[-1, 12], 1, Concat, [1]]   # 24 - cat head P5
  - [-1, 3, C2f, [1024, False]]  # 25 (P5/32-large)
  
  # Detection head standard (utilisons Detect pour l'instant)
  - [[19, 22, 25], 1, Detect, [nc]]  # Detect(P3, P4, P5)
