# YOLOv13n-Face - Architecture Ultra-légère et Précise pour la Détection de Visages
# Inspiré de YOLO12 avec optimisations spécifiques pour les visages

# Parameters
nc: 1  # number of classes (face only)
scales:
  n: [0.50, 0.25, 1024]  # depth, width, max_channels - optimisé pour être ultra-léger

# YOLOv13n-face backbone - Architecture progressive avec attention
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 4, C2fPSA, [512]]  # 6 - Position Sensitive Attention pour visages
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 4, C2fPSA, [1024]]  # 8 - Attention maximale
  - [-1, 1, SPPF, [1024, 5]]  # 9 - Spatial Pyramid Pooling Fast

# YOLOv13n-face head - Optimisé pour petits et grands visages
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 10
  - [[-1, 6], 1, Concat, [1]]  # 11 - cat backbone P4
  - [-1, 2, C2f, [512, False]]  # 12
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 13
  - [[-1, 4], 1, Concat, [1]]  # 14 - cat backbone P3
  - [-1, 2, C2f, [256, False]]  # 15 (P3/8-small)
  
  - [-1, 1, Conv, [256, 3, 2]]  # 16
  - [[-1, 12], 1, Concat, [1]]  # 17 - cat head P4
  - [-1, 2, C2fPSA, [512]]  # 18 (P4/16-medium) - Attention pour visages moyens
  
  - [-1, 1, Conv, [512, 3, 2]]  # 19
  - [[-1, 9], 1, Concat, [1]]  # 20 - cat head P5
  - [-1, 2, C3k2, [1024, True]]  # 21 (P5/32-large)
  
  - [[15, 18, 21], 1, Detect, [nc]]  # 22 - Detect(P3, P4, P5)