# YOLOv13n-Face - Architecture Innovante Optimisée
# Utilise UNIQUEMENT les modules confirmés du fork Ultralytics 8.3.148

# Model configuration
nc: 1  # number of classes (face only)
scales:
  n: [0.33, 0.25, 1024]  # model depth, width, max_channels

# YOLOv13 backbone - Architecture progressive avec attention
backbone:
  # Stage 1: Extraction de features basiques
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]  # 2
  
  # Stage 2: Features moyennes avec première attention
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]  # 4
  - [-1, 1, PSA, [256]]  # 5 - Position Sensitive Attention légère
  
  # Stage 3: Features profondes avec attention renforcée
  - [-1, 1, Conv, [512, 3, 2]]  # 6-P4/16
  - [-1, 6, C2fPSA, [512]]  # 7 - C2f avec PSA intégré
  
  # Stage 4: Features finales avec agrégation multi-échelle
  - [-1, 1, Conv, [1024, 3, 2]]  # 8-P5/32
  - [-1, 3, C2fPSA, [1024]]  # 9 - Attention maximale
  - [-1, 1, SPPELAN, [1024]]  # 10 - SPP-ELAN avancé

# YOLOv13 head - Fusion multi-échelle optimisée pour visages
head:
  # Upsampling path
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 11
  - [[-1, 7], 1, Concat, [1]]  # 12 cat backbone P4
  - [-1, 3, C2f, [512, False]]  # 13
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 14
  - [[-1, 5], 1, Concat, [1]]  # 15 cat backbone P3
  - [-1, 3, C2f, [256, False]]  # 16 (P3/8-small)
  
  # Downsampling path avec attention
  - [-1, 1, Conv, [256, 3, 2]]  # 17
  - [[-1, 13], 1, Concat, [1]]  # 18 cat head P4
  - [-1, 3, C2fPSA, [512]]  # 19 (P4/16-medium) - Attention pour visages moyens
  
  - [-1, 1, Conv, [512, 3, 2]]  # 20
  - [[-1, 10], 1, Concat, [1]]  # 21 cat head P5
  - [-1, 3, C2f, [1024, False]]  # 22 (P5/32-large)
  
  # Detection head
  - [[16, 19, 22], 1, Detect, [nc]]  # 23 Detect(P3, P4, P5)