# YOLOv13n-Face-v6 - Version avec Modules YOLOv13 Compatibles

# Model configuration
nc: 1  # number of classes (face)
scales:
  n: [0.50, 0.50, 1024]  # model depth, width, max_channels

# YOLOv13 backbone inspiré de YOLOv12 avec attention
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]  # 2 - Utiliser C2f standard d'abord
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]  # 4
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]  # 6
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]  # 8
  - [-1, 1, SPPF, [1024, 5]]  # 9

# YOLOv13 head avec modules progressifs
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 10
  - [[-1, 6], 1, Concat, [1]]  # 11 cat backbone P4
  - [-1, 3, C2f, [512, False]]  # 12
  - [-1, 1, A2Module, [512]]  # 13 - Module d'attention YOLOv12 adapté
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 14
  - [[-1, 4], 1, Concat, [1]]  # 15 cat backbone P3
  - [-1, 3, C2f, [256, False]]  # 16 (P3/8-small)
  - [-1, 1, RELAN, [256]]  # 17 - Module RELAN de YOLOv12
  
  - [-1, 1, Conv, [256, 3, 2]]  # 18
  - [[-1, 13], 1, Concat, [1]]  # 19 cat head P4
  - [-1, 3, C2f, [512, False]]  # 20 (P4/16-medium)
  
  - [-1, 1, Conv, [512, 3, 2]]  # 21
  - [[-1, 9], 1, Concat, [1]]  # 22 cat head P5
  - [-1, 3, C2f, [1024, False]]  # 23 (P5/32-large)
  
  # Detection head standard
  - [[17, 20, 23], 1, Detect, [nc]]  # 24 Detect(P3, P4, P5)