# YOLOv12-Face Enhanced - Configuration Simplifiée
# Version stable avec modules d'attention fonctionnels

# Parameters
nc: 1  # number of classes (face)
depth_multiple: 1.0
width_multiple: 1.0

# YOLOv12-Face Enhanced Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 6, 2, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]    # 1-P2/4
  - [-1, 3, C3, [128]]            # 2
  
  - [-1, 1, Conv, [256, 3, 2]]    # 3-P3/8
  - [-1, 6, C3, [256]]            # 4
  - [-1, 1, A2Module, [256, 256]] # 5 - Area Attention
  
  - [-1, 1, Conv, [512, 3, 2]]    # 6-P4/16
  - [-1, 9, C3, [512]]            # 7
  - [-1, 1, RELAN, [512, 512]]    # 8 - Residual ELAN
  
  - [-1, 1, Conv, [1024, 3, 2]]   # 9-P5/32
  - [-1, 3, C3, [1024]]           # 10
  - [-1, 1, SPPF, [1024, 5]]      # 11

# YOLOv12-Face Enhanced Head
head:
  - [-1, 1, Conv, [512, 1, 1]]                 # 12
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 13
  - [[-1, 8], 1, Concat, [1]]                  # 14 cat backbone P4
  - [-1, 3, C3, [512, False]]                 # 15

  - [-1, 1, Conv, [256, 1, 1]]                 # 16
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 17
  - [[-1, 5], 1, Concat, [1]]                  # 18 cat backbone P3
  - [-1, 3, C3, [256, False]]                 # 19 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                 # 20
  - [[-1, 16], 1, Concat, [1]]                 # 21 cat head P4
  - [-1, 3, C3, [512, False]]                 # 22 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                 # 23
  - [[-1, 12], 1, Concat, [1]]                 # 24 cat head P5
  - [-1, 3, C3, [1024, False]]                # 25 (P5/32-large)

  - [[19, 22, 25], 1, Detect, [nc]]           # Detect(P3, P4, P5)
