# YOLOv12-Face Enhanced Simplified Configuration
# Version utilisant uniquement les modules Ultralytics existants
# Optimisé pour la détection de visages avec techniques 2025

# Parameters
nc: 1  # number of classes (face)
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]  # nano
  s: [0.50, 0.50, 1024]  # small
  m: [0.50, 1.00, 512]   # medium
  l: [1.00, 1.00, 512]   # large
  x: [1.00, 1.50, 512]   # extra-large

# YOLOv12-Face Enhanced Backbone (utilisant modules existants)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  
  # C3k2 amélioré pour petits visages
  - [-1, 3, C3k2, [256, False, 0.25]]  # 2 - Plus de répétitions
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  
  # Bloc intermédiaire avec plus de profondeur
  - [-1, 3, C3k2, [512, False, 0.25]]  # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  
  # C3k2 avec shortcuts pour stabilité (similaire à R-ELAN)
  - [-1, 3, C3k2, [1024, True, 0.5]]  # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  
  # Bloc final avec C3k2 profond
  - [-1, 3, C3k2, [1024, True, 0.5]]  # 8
  
  # SPPF avec kernels plus petits pour visages
  - [-1, 1, SPPF, [1024, 3]]  # 9

# YOLOv12-Face Enhanced Head
head:
  # Upsample path
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 10
  - [[-1, 6], 1, Concat, [1]]  # 11 - cat backbone P4
  - [-1, 3, C3k2, [512, False]]  # 12 - Plus de C3k2
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 13
  - [[-1, 4], 1, Concat, [1]]  # 14 - cat backbone P3
  - [-1, 3, C3k2, [256, False]]  # 15 (P3/8-small)
  
  # Downsample path
  - [-1, 1, Conv, [256, 3, 2]]  # 16
  - [[-1, 12], 1, Concat, [1]]  # 17 - cat head P4
  - [-1, 3, C3k2, [512, False]]  # 18 (P4/16-medium)
  
  - [-1, 1, Conv, [512, 3, 2]]  # 19
  - [[-1, 9], 1, Concat, [1]]  # 20 - cat head P5
  - [-1, 3, C3k2, [1024, True]]  # 21 (P5/32-large)
  
  # Detect head standard
  - [[15, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)
